UCP 1.2

[Academy_HallHeroes.A_HeroBio_Ghali_1_Main H7HeroBioData]
mText="当一位贵族巫师家庭的女儿即将结婚时，她决定要确保自己能做出最好的选择。于是她制定了一个特别的计划……"

[Academy_HallHeroes.A_HeroBio_Jadwa_1_Main H7HeroBioData]
mText="如果不是她的父亲马斯法尔，贾德瓦早已死去，灵魂安息。她被迫从灵魂世界归来，灵魂被困在石像鬼躯壳中的她渴望回归，不惜摧毁路上的一切人事物，包括她曾经的家人。"

[Dungeon_HallHeroes.A_HeroBio_Himiko_1_Main H7HeroBioData]
mText="卑弥呼出生于娜迦的海底王国。她是个早熟的孩子，加入了珍珠祭司的行列，毕生奉献于崇拜水龙女神，帮助受压迫者，为受伤者带来和平。这一切在她目睹帝国舰队在兽人十字军东征最后几天被摧毁时改变了。当莎拉萨的一个化身摧毁人类船只，淹死数百名水手时，温柔的卑弥呼内心某些东西破碎了。她开始对莎拉萨的破坏者一面产生病态的痴迷。她的信仰变得如此扭曲，最终被莲花帝国驱逐，并被烙上异端的烙印。卑弥呼迁往蛮荒海，并开始着手实施一项计划，以更大规模执行破坏者的意志。"

[Fortress_HallHeroes.A_HeroBio_Iark_1_Main H7HeroBioData]
mText="这位英雄的命运笼罩在神秘之中……他被龙神阿尔卡斯亲自选为他的使者，执行他的意志。因此，他掌控着最明亮火焰的力量。他过去是谁，我们可能永远无法知晓。"

[Fortress_HallHeroes.A_HeroBio_Roek_1_Main H7HeroBioData]
mText="聪明、敏捷、强壮……从没有人用这些形容词谈论过罗埃克。与他的同胞不同，罗埃克似乎对他尝试过的任何事情都没有天赋。但一个心碎沮丧的矮人，正是那些隐藏在阴影中、等待时机启动其毁灭性计划的人的理想目标……"

[Haven_HallHeroes.A_HeroBio_Francis_1_Main H7HeroBioData]
mText="灰狗领的一位男爵，被派去协助康拉德的 quest。他是个高尚的人，几乎无所畏惧，并且从不怀疑给他的命令。据他说，人问太多问题很快就会惹上麻烦。“从不提问，从不抱怨，”可能是他的座右铭。"

[Necropolis_HallHeroes.A_HeroBio_Haffayad_1_Main H7HeroBioData]
mText="一位被蜘蛛女神扭曲之美所诱惑的七城联邦巫师，哈法亚德在阿吉雷的指导下成为了一名亡灵巫师。他是一个非常虔诚地崇拜龙神阿沙的人。他的研究使他晋升为高阶祭司。众所周知，当他的敌人嘲弄他的信仰时，他会非常急躁和易怒。"

[Necropolis_HallHeroes.A_HeroBio_Saahir_1_Main H7HeroBioData]
mText="巫师萨希尔是声名狼藉的埃米尔转为恶魔崇拜者马利克的弟弟。萨希尔本性善良，但一直更专注于自己对奥术知识的研究，所以当他发现哥哥的堕落时，他为自己没有预见而感到自责。他与马利克对峙，希望能让他恢复理智，但他的哥哥已经无可救药，毫不犹豫地从背后刺伤了他，让他在燃烧的沙漠中腐烂。萨希尔奇迹般地活了下来，但他永远地改变了。如今怀抱着 grim 的决心，他加入了蜘蛛 cult，成为对抗他哥哥所代表的混沌的秩序 champion。"

[Necropolis_HallHeroes.A_HeroBio_Scatha_1_Main H7HeroBioData]
mText="斯卡莎二十四岁时离开了图德哈娜王国，应阿珊最伟大的武器大师之一、魔剑士德拉斯·班的邀请，前往七城联邦学习剑术。她是一名出色的学生，并且一直如此，直到她的女王遭到神圣猎鹰帝国的攻击。此时，德拉斯·班极为珍视他这位得意门生，担心七城联邦的大法师们会站在皇帝利亚姆一边，将她作为“善意”的象征而囚禁起来，于是将她藏匿在他的家乡阿尔-贝提尔城。在藏身于一个奢华的地窖期间，斯卡莎结识了蜘蛛女神 cult。关于她的皈依有很多谜团，但有人说她找到了对抗伴随帝国军队而来的致命光芒的方法。"

[Stronghold_HallHeroes.A_HeroBio_Arril H7HeroBioData]
mText="阿瑞尔曾在七城联邦学习，立志成为气系魔法大师。她以进行令人印象深刻（有时是冒险的）闪电实验而闻名。当其中一次实验失控，一道强烈的闪电击中了阿尔-伊姆拉尔的最高塔时，一群欣赏她勇气的空气元素救了她，使她免于被倒塌的废墟掩埋。她知道如果留下将面临后果，于是让元素们带她向东前往崇拜天空之父的山区部落，在那里她找到了第二个家。终于，她不再被人畏惧，而是受到赞扬。"

[Stronghold_HallHeroes.A_HeroBio_Mokka_1_Main H7HeroBioData]
mText="莫卡出生在拉纳尔东部草原的一个自由兽人部落，长大后成为了一位强大的猎人，受到兽人和半人马们的尊敬。一天，一群来自保群岛的兽人难民来到她的村庄，讲述了他们如何遭到袭击，他们的孩子被卖为奴隶的故事。莫卡被这种耻辱激怒了，并向天空之父发誓，只要她一息尚存，就绝不让任何一个兽人戴上锁链。她立即带着一支小军队出发前往南方，寻找她的命运。唉，莫卡那支斗志昂扬、勇敢无畏的部落在她穿越山脉时遭到了狼公爵的伏击，全部被俘或被杀。被送去矿山劳役的莫卡以夸张的方式成功逃脱。她用镐杀死了七名守卫，并骑着一匹半马逃走了。如今，她作为保群岛的永久居民，一位有理想的叛逆者，已成为所有怀有自由梦想的兽人的 inspiration。"

[Stronghold_HallHeroes.A_HeroBio_Ruqav_1_Main H7HeroBioData]
mText="鲁卡夫是一个保群岛兽人，比大多数人更能感受到权力的无形威胁。当部落的上任萨满年老去世时，他自然成为了替代者。鲁卡夫深感担忧，在冈根担任大名时兽人与娜迦之间存在的相互尊重，已被新大名广志的崛起所粉碎。随着亡灵巫师入侵北方陆连岛屿的谣言 spread，鲁卡夫在每个黄昏时分都侦察着地平线，寻找乌拉甘归来的迹象，同时犹豫是否要与娜迦结盟，以防有诈。"

[Sylvan_HallHeroes.A_HeroBio_Adowyn H7HeroBioData]
mText="阿朵温是一个半精灵，她的出身不明，但你可以清楚地看到，尽管生活在森林居民中，她仍是不同的。她年轻时曾与人类一起生活，并意识到自己拥有治疗魔法的天赋，于是她加入了维斯塔尔修会，成为了一名女祭司。即使在返回伊罗兰后，她也没有摆脱那些联系，这就是为什么当需要与帝国谈判时，她是最佳人选之一。"

[Sylvan_HallHeroes.A_HeroBio_Grumthor H7HeroBioData]
mText="当格鲁姆索还是个孩子，正在学走路的时候，他摔倒的次数比其他人多得多。令所有观看这些尝试的人惊讶的是，格鲁姆索每次摔倒都不哭。更有甚者，他还笑了，所以他似乎真的很享受摔倒。即使长大后，他似乎仍然对坠落物体和人有些着迷。有一天，他目睹了一场影响整个伊罗兰南部的强烈地震。这样的经历让他兴奋不已，他立即决定必须重演这一幕。第二天，他离开了伊罗兰，开始周游世界。每当阿珊发生任何地震时，请相信格鲁姆索一定就在附近。"

UCP 1.3

[Academy_HallHeroes.A_HeroBio_Asalah_1_Main H7HeroBioData]
mText="阿萨拉一直害怕黑暗。作为一个躺在床上的小孩，她会在旁边放一盏小灯，相信它能保护她免受黑暗中隐藏的所有邪恶事物的伤害，直到她学会了自己召唤光芒。她感受到许多巫师心中日益增长的恐惧，因为永恒之屋越来越深地沉浸于魔法最黑暗的方面，并决定帮助那些巫师驱散黑暗。然而，与帝国的狂热分子不同，她相信光明的存在只有在它能穿透黑暗照耀时才有意义，并且两种元素可以共同存在于世界上。"

[Dungeon_HallHeroes.A_HeroBio_Lorelei_1_Main H7HeroBioData]
mText="罗蕾莱生而为人，在狼公国。她曾有过名字和家庭。但当她和她的亲属试图穿过被诅咒的黑林时，一群可怕的疯狂野兽和丑陋生物袭击了他们。她的父母被那些疯狂的生物杀死了。\n依靠自己，这个女孩设法在这个阴森的森林里独自生存了数周，证明了自己比追踪她的捕食者更聪明。在经历严酷考验挑战了她的理智后，她开始认为自己就是罗蕾莱，以她家乡公国一个 popular 童话中的河泽仙女命名。\n她最终被马拉萨本人留下的低语痕迹引来的黑暗精灵侦察兵发现。精灵们立刻明白了发生了什么，并决定带女孩回去。据传言，在与黑暗精灵共度的时光里，她找到了延长寿命的方法。没有人知道她是如何——或者是否——成功做到的，但考虑到人类通常短暂的寿命，她似乎确实活了出奇长的时间。"

[Haven_HallHeroes.A_HeroBio_Balthasar_1_Main H7HeroBioData]
mText="“苹果不会落在离树太远的地方”，俗话说。对于这位雄心勃勃的牧师——声名狼藉的审判官萨尔瓦多的远亲——来说，这话再正确不过了。就像他的祖先一样，他为了获取权力不择手段，辩称他所做的一切都是为了艾尔拉思。目前，据传闻他领导着一群自称“血腥牧师”的狂热分子。"

[Haven_HallHeroes.A_HeroBio_Euridika_1_Main H7HeroBioData]
mText="尤瑞迪卡似乎有一种非凡的天赋，总能找到那些需要她帮助的人。她几乎每次出门都会遇到某个 desperately 请求她帮忙的人。尽管这有时会变得乏味，但她从不抱怨，并且至少从外表上看，她依然像她被教导的那样开朗和乐于助人。"